{
  "posts": [
    {
      "title": "Простая, доступная и полезная Wi-Fi лаборатория. Сделай сам",
      "description": "Если вы серьезно занимаетесь Wi-Fi, то у вас точно есть своё лабораторное оборудование. Без него, на мой взгляд, не обойтись. Если вы собираетесь серьезно заниматься Wi-Fi, то рано или поздно, у вас возникнет необходимость обзавестись лабораторией. В этой статье я расскажу, как сделать это с минимальными затратами и для каких задач лаборатория может быть необходима, на реальных примерах...",
      "url": "https://m.habrahabr.ru/post/352864/",
      "attachment": "3.jpg",
      "tag": "2"
    },
    {
      "title": "Применение .gitignore в существующем или действующем проекте",
      "description": ".gitignore — это файл, в котором хранятся записи о директориях и файлах, которые не нужно отслеживать СКВ. Бывают ситуации, когда Вы трудитесь над проектом, заливаете новые коммиты на Git, и замечаете, что все со всеми вашими файлами улетают также и системные файлы: данные вашей IDE, временные конфигурации приложения, данные кэша и так далее. Эти файлы нет нужды контролировать используя Git, так как они всегда будут разными, постоянно будут изменяться и Ваши манипуляции к их персонам, по сути, бессмысленны. По этой причине появился .gitignore...",
      "url": "http://nikulux.ru/git-uroki/primenenie-gitignore-v-sushhestvuyushhem-ili-dejstvuyushhem-proekte/",
      "attachment": "1.png",
      "tag": "23"
    },
    {
      "title": "Пример организации кода для сложного Angular проекта",
      "description": "Официальная документация Angular неплохо описывает, а angular-cli автоматически создает структуру относительно простого проекта. Но по мере его развития сложность неизбежно растет и возникает естественная необходимость как-то этой сложностью управлять. В том числе и за счет декомпозиции...",
      "url": "https://m.habrahabr.ru/post/352092/",
      "attachment": "4.jpg",
      "tag": "22"
    },
    {
      "title": "Конференция DEFCON 22. «Один дома с автоматической системой защиты». Крис Литтлбери",
      "description": "Меня зовут Крис Литтлбери, я работаю старшим испытателем систем безопасности от проникновений в компании Knowledge Consulting Group, которая расположена в округе Колумбия. Я люблю конструировать всякие интересные вещи, придавая обычным устройствам необычные функции. Например, вот этот контроллер XBox Live быстро обнаруживает пожар. Я использовал его всего один раз, скомбинировав с микропроцессором Arduino. На второй картинке показано устройство для замены пятой передачи в коробке передач моего автомобиля, которое улучшает пробег. Я люблю делать вещи своими руками...",
      "url": "https://m.habrahabr.ru/company/ua-hosting/blog/352658/",
      "attachment": "5.jpg",
      "tag": "2"
    },
    {
      "title": "ООП: создание и работа с классами в Python",
      "description": "Парадигма объектно-ориентированного программирования (ООП) в наше время используется повсеместно. Чем она так хороша? При использовании объектно-ориентированного подхода в процессе написания кода, разработчик выстраивает логику так, чтобы оперировать объектами. Почему именно объекты? Объект наиболее удобен для восприятия, так как похож на элемент привычной нам реальной жизни. У каждого объекта есть свои параметры, свойства, особенности, отличные и одинаковые черты при сравнении их с другими объектами. Каждый объект в некотором роде уникален, но при этом множество объектов имеют схожие черты с другими объектами. Значит, существуют параметры, атрибуты, свойства которые идентичны для определённого набора объектов. Так появилось понятие класса...",
      "url": "http://nikulux.ru/python_uroki/oop-sozdanie-i-rabota-s-klassami-v-python/",
      "attachment": "2.jpg",
      "tag": "16"
    },
    {
      "title": "Прокачиваем производительность C# с Федерико Луисом",
      "description": "Сегодня мы поговорим о производительности в C#, о способах прокачать её до неузнаваемости. Задача этой статьи — продемонстрировать такие способы повышения производительности, которые, при необходимости, вы смогли бы использовать самостоятельно. Однако эти методики не являются универсальными — вы не сможете использовать их в качестве общего решения любой задачи. Они хороши при наличии вполне конкретных сценариев использования, о которых пойдет речь ниже. В качестве прототипа статьи был выбран доклад Федерико Луиса, основателя компании Corvalius (они занимаются R&D). Работая над движком базы данных для одного из клиентов, они посвятили около четырёх лет задачам оптимизации. Такое количество времени требуется для того, чтобы применить разного рода техники и достичь хороших показателей оптимизации. Требуется выявить все проблемы и узкие места, проследить поведение софта в соответствии со всеми имеющимися метриками и так далее. Примеры из этой статьи основаны на работе над RavenDB 4.0 (известная NoSQL база для .NET), которую компания Федерико тюнила до уровня наносекунд во всевозможных сложных кейсах...",
      "url": "https://m.habrahabr.ru/company/jugru/blog/352362/",
      "attachment": "---",
      "tag": "18"
    },
        {
      "title": "---",
      "description": "---",
      "url": "---",
      "attachment": "---",
      "tag": "---"
    },
    {
      "title": "20 модулей для Node.js, о которых полезно знать",
      "description": "Филип Акерман, автор статьи, перевод которой мы сегодня публикуем, говорит, что в последние годы платформа Node.js становится всё популярнее и популярнее. Она часто используется для создания серверных частей веб-приложений, а также для решения других задач, возникающих в процессе разработки ПО. В настоящее время в реестре npm, менеджера пакетов для Node.js, насчитывается более полумиллиона модулей...",
      "url": "https://m.habrahabr.ru/company/ruvds/blog/352636/",
      "attachment": "---",
      "tag": "24"
    },
    {
      "title": "Вечный фотоархив для дома",
      "description": "Не понимаю желания ностальгировать на старые фотографии. Но девчонок не переделаешь, поэтому пришлось подумать про хранилище для всех, чтобы больше не приставали показать с компа карапузов и котиков. В публичное облако выкладывать все фотки подряд не хочется...",
      "url": "https://m.habrahabr.ru/post/352494/",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Cтажерская ретроспектива",
      "description": "Всем привет! Я Вера, и четвертый год занимаюсь в JetBrains студенческими стажировками. Давно хочется рассказать про это Хабру, но не наскучивать же вам справочной информацией! Поэтому расскажу про одного из своих первых стажеров. Знакомьтесь, это − Валя Кирюшкина, разработчик Educational Products, руководитель академической практики JetBrains и студентка Computer Science Center. А началось всё именно с него...",
      "url": "https://m.habrahabr.ru/company/JetBrains/blog/353400/",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Пятничный JS: минус без минуса",
      "description": "И вновь я приветствую всех в моей традиционной рубрике. Сегодня вы узнаете, что же такого особенного произошло 31 декабря 1969 года, ровно за миллисекунду до полуночи. Точнее, вы узнаете не только лишь это, но только к этому примеру я смог подобрать картинку, а развлекательная статья без картинок — нонсенс...",
      "url": "https://m.habrahabr.ru/post/352428/",
      "attachment": "---",
      "tag": "22"
    },
    {
      "title": "Полезные нагрузки для тестирования веб-приложений",
      "description": "Использование полезных нагрузок (пейлоадов) позволяет проводить фаззинг веб-приложения, для выявления аномалий/признаков уязвимостей. В этой статье я рассмотрю несколько вариантов пейлоадов для тестирования веб-приложений. Полезные нагрузки Полезные нагрузки представляют из себя список последовательностей символов, служебных команд, имен файлов, т.н. полиглотов и т.д. и служат для полуавтоматизированного исследования веб-приложений. Если говорить простыми словами — исследователь выявляет точки входа (инпут формы, аргументы, динамически поля) и подает в качестве значений полезные нагрузки...",
      "url": "https://m.habrahabr.ru/company/pentestit/blog/352422/",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Реактивный фронтенд. История о том, как мы снова всё переписали",
      "description": "Продолжаю свою историю о том, как я перестала верстать и начала жить. В первой части я рассказала, как меня сюда занесло и чем занимаются наши фронтендеры. Сегодня — про фронтовый стек, откуда там React и куда делся БЭМ...",
      "url": "https://habr.com/company/yamoney/blog/414183/?utm_source=habrahabr&utm_medium=rss&utm_campaign=414183",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Можно ли «хакнуть» ASP инфраструктуру?",
      "description": "Как говорят специалисты по информационной безопасности «Ломают всё, всех и всегда». При этом, атаки на ASP.NET — вещь достаточно редкая. Поэтому всегда крайне любопытно узнавать про это что-то новое. Под катом рассказ специалиста отдела информационной безопасности Rambler Group Алексея Морозова о сильных и слабых сторонах данной технологии...",
      "url": "https://habr.com/company/rambler-co/blog/413649/?utm_source=habrahabr&utm_medium=rss&utm_campaign=413649",
      "attachment": "---",
      "tag": "18"
    },
    {
      "title": "Angular6. PWA. Lazy loading modules. Auto-deploy в Firebase",
      "description": "Angular 6 позволяет буквально в несколько команд создать основу для Progressive Web Application (PWA), создавать верстку для навигационных страниц, таблиц, dashboard...",
      "url": "https://habr.com/post/413679/?utm_source=habrahabr&utm_medium=rss&utm_campaign=413679",
      "attachment": "---",
      "tag": "22"
    },
    {
      "title": "Заблуждения программистов о трудоустройстве",
      "description": "Я не сразу устроился на достойную работу. Мне вполне хватало технических навыков, но я просто сдерживал себя. На это не было никаких причин, кроме глупых предположений о том, что хочет работодатель. Я пошёл на дерьмовую работу и тратил всё свободное время на коммиты Github ради улучшения профиля. Я тогда не знал, что принимающим решение людям практически не интересен этот код. Прошло четыре года. Теперь я лучше понимаю процедуру трудоустройства и то, как увеличить свои шансы, используя логику нанимателя. В стиле известной статьи Патрика Маккензи об именах, вот список главных заблуждений, которые могут быть у программистов (особенно начинающих)...",
      "url": "https://habr.com/post/413937/?utm_source=habrahabr&utm_medium=rss&utm_campaign=413937",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Стеганография в IP-пакетах",
      "description": "Однажды, перед защитой очередной лабораторной работы мне задали вопрос: какие поля IP-пакета можно использовать для стегано? Я не знал и лишь пожал плечами. Но вскоре я всё же решил изучить этот вопрос. Под катом вас ждёт изучение заголовков IP-пакетов, собственная утилита ping на Python и несколько способов передать данные, не привлекая внимания...",
      "url": "https://habr.com/post/413851/?utm_source=habrahabr&utm_medium=rss&utm_campaign=413851",
      "attachment": "---",
      "tag": "13"
    },
    {
      "title": "Как не надо писать код",
      "description": "Готовы погрузиться с головой в дивный мир программирования? Хотите узнать как непредсказуемо могут повести себя несколько простых строк кода? Если ваш ответ 'Да!' — добро пожаловать под кат. Вас будут ждать несколько занимательных задачек на С или С++. Правильный ответ с объяснением всегда будет спрятан под спойлером...",
      "url": "https://habr.com/post/413697/?utm_source=habrahabr&utm_medium=rss&utm_campaign=413697",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Из студента в стажёры и разработчики: мой опыт стажировки",
      "description": "В нашей компании существует программа стажировки, благодаря которой студенты могут не только получить опыт работы над серьёзными проектами, но и сразу трудоустроиться в рамках интересующего IT-направления. В качестве примера хочу привести свою историю, как я к 21 году, ещё не успев закончить университет и программу обучения Технопарка, уже стал штатным разработчиком в проекте Почта Mail.Ru и выступил с докладом в главном зале на РИТ++. Но обо всём по порядку...",
      "url": "https://habr.com/company/mailru/blog/413451/?utm_source=habrahabr&utm_medium=rss&utm_campaign=413451",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Год, проведённый с React: выводы и рекомендации",
      "description": "Обычно начало работы с новой технологией — это не так уж и просто. Новичок попадает в бескрайнее море учебных руководств и статей. При этом за каждым из подобных материалов стоит личное мнение его автора, а каждый автор заявляет, что именно его устами глаголет истина. С точки зрения здравого смысла понятно, что далеко не все статьи, опубликованные в интернете, способны принести реальную пользу, поэтому тем, кто пытается освоить что-то новое, приходится оценивать публикации в попытке найти ответ на вопрос о том, стоит ли тратить на них своё время...",
      "url": "https://habr.com/company/ruvds/blog/413501/?utm_source=habrahabr&utm_medium=rss&utm_campaign=413501",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Общая картина модульного тестирования",
      "description": "Это не руководство, какие символы нужно ввести в редакторе кода, чтобы получились модульные тесты. Это — пища для ума, которую необходимо употребить до того, как предпринимать упомянутые действия. Тема модульного тестирования не так проста, как может показаться. Многие из нас, разработчиков, приходят в модульное тестирование под давлением клиентов, сотрудников, коллег, своих кумиров и так далее. Мы быстро понимаем его ценность, и, закончив технические приготовления, забываем об общей картине, если вообще когда-либо её понимали. В этой статье я вкратце расскажу о том, чем является и чем не является модульное тестирование как в целом, так и в PHP, а заодно опишу, какое место занимает модульное тестирование в сфере QA...",
      "url": "https://habr.com/company/mailru/blog/412695/?utm_source=habrahabr&utm_medium=rss&utm_campaign=412695",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Команды для работы с JavaScript-консолью в браузерах и повышение производительности труда программиста",
      "description": "Если вы занимаетесь веб-программированием, это значит, что вам не надо рассказывать о том, насколько в вашей работе важна отладка. Нередко для записи данных в логи, для их форматирования или вывода на экран используют внешние библиотеки, не учитывая при этом того факта, что в распоряжении программистов имеются JavaScript-команды для работы с консолями, которые встроены в браузеры. И обладают эти консоли гораздо более серьёзными возможностями, чем может показаться на первый взгляд...",
      "url": "https://habr.com/company/ruvds/blog/414375/?utm_source=habrahabr&utm_medium=rss&utm_campaign=414375",
      "attachment": "---",
      "tag": "22"
    },
    {
      "title": "Митап JavaJam. Спор о джавистах, сплав на брёвнах, эксперименты и микросервисы",
      "description": "Java-разработчики классные. Фронтендеры их хвалят и перенимают полезные инструменты, дизайнеры с особой любовью приносят макеты, а тестировщики ликуют, потому что все автоматизировано и жизнь — сахар (но об этом мы пока не рассказывали). Иногда мы проводим для них java-митапы — собираем экспертов и просим их рассказать что-нибудь позабористей. Так и в этот раз — коллеги из Сбербанка, Одноклассников, Яндекса и Яндекс.Денег пришли на JavaJam и выложили сразу кучу подробностей о своей работе...",
      "url": "https://habr.com/company/yamoney/blog/414431/?utm_source=habrahabr&utm_medium=rss&utm_campaign=414431",
      "attachment": "---",
      "tag": "17"
    },
    {
      "title": "Разработка чат-бота для Facebook Messenger на node.js",
      "description": "Материал, перевод которого мы сегодня представляем вашему вниманию, посвящён разработке чат-бота для Facebook Messenger. Бот, который называется Aww Bot, общаясь с пользователями, будет отправлять им картинки симпатичных котов и собак...",
      "url": "https://habr.com/company/ruvds/blog/414081/?utm_source=habrahabr&utm_medium=rss&utm_campaign=414081",
      "attachment": "---",
      "tag": "24"
    },
    {
      "title": "toString: Великий и Ужасный",
      "description": "Функция toString в языке JavaScript наверно самая 'неявно' обсуждаемая как среди самих js-разработчиков, так и среди внешних наблюдателей. Она — причина многочисленных шуток и мемов про многие подозрительные арифметические операции, преобразования, вводящие в ступор [object Object]'ы. Уступает, возможно, лишь удивлениям при работе с float64. Интересные случаи, которые мне приходилось наблюдать, использовать или преодолевать, мотивировали меня написать настоящий разбор полетов. Мы галопом проскочим по спецификации языка и на примерах разберем неочевидные особенности toString...",
      "url": "https://habr.com/post/414495/?utm_source=habrahabr&utm_medium=rss&utm_campaign=414495",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Разработка нового статического анализатора: PVS-Studio Java",
      "description": "Статический анализатор PVS-Studio известен в мире C, C++ и C# как инструмент для выявления ошибок и потенциальных уязвимостей. Однако у нас мало клиентов из финансового сектора, так как выяснилось, что сейчас там востребованы Java и IBM RPG(!). Нам же всегда хотелось стать ближе к миру Enterprise, поэтому, после некоторых раздумий, мы приняли решение заняться созданием Java анализатора...",
      "url": "https://habr.com/company/pvs-studio/blog/414669/?utm_source=habrahabr&utm_medium=rss&utm_campaign=414669",
      "attachment": "---",
      "tag": "17"
    },
    {
      "title": "Могут ли PWA (Progressive Web Apps) образца 2018 года составить достойную конкуренцию нативным приложениям?",
      "description": "Когда изменения происходят постепенно, шаг за шагом, порой бывает трудно заметить насколько они драматичны и всеобъемлющи. Казалось бы всего несколько лет назад web платформа проигрывала нативным приложением практически по всем фронтам, и пропасть между тем, что можно было сделать в браузере, и тем, что было доступно приложениями, загружаемым из магазинов, таких как Apple App Store или Google Play Store, была ужасающе огромной. Одним из свидетельств этой пропасти является то, что в 2007 году web по факту был основной платформой разработки приложений для первого iPhone, но эта платформа явно не взлетела. App Store же появился только год спустя со второй версии операционной системы, и сразу же случился бум нативных приложений, который и сформировал рыночный ландшафт таким, каким мы его знаем теперь...",
      "url": "https://habr.com/company/google/blog/414609/?utm_source=habrahabr&utm_medium=rss&utm_campaign=414609",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Quantum Mechanics of Calculations in JS",
      "description": "Здравствуйте, меня зовут Дмитрий Карловский и я… безработный. Поэтому у меня есть много свободного времени для занятия музыкой, спортом, творчеством, языками, JS-конференциями и компьютерной наукой. О последнем исследовании в области полуавтоматического разбиения долгих вычислений на небольшие кванты по несколько миллисекунд, в результате которого появилась миниатюрная библиотека $mol_fiber, я вам сегодня и расскажу. Но сперва, давайте обозначим проблемы, которые мы будем решать...",
      "url": "https://habr.com/post/413791/?utm_source=habrahabr&utm_medium=rss&utm_campaign=413791",
      "attachment": "---",
      "tag": "22"
    },
    {
      "title": "Дипломные работы выпускников Технопроектов, весна 2018",
      "description": "Дважды в год мы набираем студентов в наши Технопроекты, и дважды в год выпускаем лучших из них только после защиты дипломного проекта, доказывающего, что не зря они два года впитывали IT-премудрости. 22 мая прошла очередная защита, на которой кроме выпускников Технопарка (МГТУ), Технотрека (МФТИ) и Техноатома (МИФИ) впервые выступали и ребята из нашего Технополиса (Санкт-Петербургский политехнический университет им. Петра Великого). А еще новшеством этой защиты стали 4 выпускных проекта, которые делали совместно студенты из российских ВУЗов и студенты Worcester Polytechnic Institute (Массачусетс, США). И сегодня мы расскажем о шести самых интересных выпускных проектах этой защиты...",
      "url": "https://habr.com/company/mailru/blog/415323/?utm_source=habrahabr&utm_medium=rss&utm_campaign=415323",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Как работает JS: классы и наследование, транспиляция в Babel и TypeScript",
      "description": "В наши дни использование классов являются одним из самых популярных способов структурирования программных проектов. Этот подход к программированию применяется и в JavaScript. Сегодня мы публикуем перевод 15 части серии материалов, посвящённых экосистеме JS. В этой статье речь пойдёт о различных подходах к реализации классов в JavaScript, о механизмах наследования и о транспиляции. Начнём мы с рассказа о том, как работают прототипы и с анализа различных способов имитации наследования, основанного на классах, в популярных библиотеках. Далее мы поговорим о том, как, благодаря транспиляции, можно писать JS-программы, использующие возможности, которые либо отсутствуют в языке, либо, хотя и существуют в виде новых стандартов или предложений, находящихся на разных стадиях согласования, пока не реализованы в JS-движках. В частности, речь пойдёт о Babel и TypeScript и о классах ECMAScript 2015. После этого мы разберём несколько примеров, демонстрирующих особенности внутренней реализации классов в JS-движке V8...",
      "url": "https://habr.com/company/ruvds/blog/415377/?utm_source=habrahabr&utm_medium=rss&utm_campaign=415377",
      "attachment": "---",
      "tag": "22"
    },
    {
      "title": "Поехали! Или немного о проектировании интерфейса выбора дат",
      "description": "Выбор дат (дальше, для простоты, буду употреблять слово календарь) на сайтах используют часто. Бронирование отелей, перелетов, автомобилей, покупка билетов. Настолько заезженная тема, что и писать о ней смысла, казалось бы, нет. Но… не так давно, передо мной стояла задача спроектировать календарь выбора периодов. Диапазон выбора дат варьировался от 2-х дней до нескольких месяцев...",
      "url": "https://habr.com/post/415365/?utm_source=habrahabr&utm_medium=rss&utm_campaign=415365",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Форматирование чисел в Java: DecimalFormat",
      "description": "Весь код, предоставленный ниже, показывает, что инстансы, которые возвращает “getInstance” NumberFormat, на самом деле являются инстансами DecimalFormat. От аналогичных инстансов класса DecimalFormat их отличают настройки атрибутов, например, минимум/максимум целых значений (слева от десятичной точки) и минимум/максимум дробных значений (справа от десятичной точки). Все они имеют одинаковый режим округления и настройки валют...",
      "url": "https://habr.com/company/otus/blog/415521/?utm_source=habrahabr&utm_medium=rss&utm_campaign=415521",
      "attachment": "---",
      "tag": "17"
    },
    {
      "title": "Так ли мал Alpine 3.8 Docker для Python 3 runtime",
      "description": "Совсем недавно произошёл релиз минималистичного Alpine Linux 3.8. Очень часто данный linux образ используют в докере, собирая очень компактные окружения для runtime. Сегодняшняя статья будет рассмотрена в срезе использования runtime системы в докере для Python 3.6.X версий, с различным составом пакетов pip. А так же мы соберём самый новый Python 3.7 в Alpine. В конце статьи будет представлен размер образа image, занимаемый на диске, в зависимости от состава пакетов pip и произведено сравнение между дистрибутивами Alpine 3.8, Debian 9, Fedora 28...",
      "url": "https://habr.com/post/415513/?utm_source=habrahabr&utm_medium=rss&utm_campaign=415513",
      "attachment": "---",
      "tag": "16"
    },
    {
      "title": "7 типичных ошибок при сравнении своих серверов с облаком",
      "description": "Многие сомневаются, что облака обходятся дешевле собственного железа — такую точку зрения мы в ActiveCloud встречаем довольно часто. Одни пользуются облаками из-за гибкости, вторые хотят уйти от рутины, третьим нужна централизация, четвёртым — безопасность. Однако облака не только удобны, но и выгодны, и мы попробуем объяснить почему...",
      "url": "https://habr.com/company/activecloudru/blog/415483/?utm_source=habrahabr&utm_medium=rss&utm_campaign=415483",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Топ-10: лучшие доклады Joker 2017",
      "description": "Недавно мы открыли для всех видеозаписи докладов Joker 2017. А когда в публичный доступ попадают сразу сорок Java-докладов, в чём тут может быть проблема? В том, что глаза разбегаются! Когда столько всего, непонятно, на что обратить внимание в первую очередь. Можно ориентироваться на зрительские оценки: начать с докладов, которые сильнее всего понравились людям, сидевшим в зале. Поэтому мы составили для вас десятку главных видеозаписей, снабдив их небольшими описаниями...",
      "url": "https://habr.com/company/jugru/blog/415701/?utm_source=habrahabr&utm_medium=rss&utm_campaign=415701",
      "attachment": "---",
      "tag": "17"
    },
    {
      "title": "Компилятор Go: язык описания правил SSA оптимизаций",
      "description": "В компиляторе gc для описания Static Single Assignment (SSA) правил оптимизаций используется специальный Лисп-подобный предметно-ориентированный язык (DSL). Предлагаю разобрать основные элементы этого языка, его особенности и ограничения. В качестве упражнения, добавим в Go компилятор генерацию инструкции, которую он раньше не генерировал, оптимизируя выражение a*b+c. Это первая статья из серии про внутренности Go SSA compiler backend, поэтому помимо обзора самого DSL описания правил мы рассмотрим связанные компоненты, чтобы создать необходимую базу для нашей следующей сессии...",
      "url": "https://habr.com/post/415771/?utm_source=habrahabr&utm_medium=rss&utm_campaign=415771",
      "attachment": "---",
      "tag": "25"
    },
    {
      "title": "Markdown база знаний (или блог, или документация проекта)",
      "description": "Заметил за собой, что постоянно записываю всякие мелочи, полезную информацию, просто что-то из буфера обмена прямо в текстовом редакторе. Всегда где-то на фоне висит открытый Sublime Text с кучей вкладок. И ещё я заметил, что мне удобнее всего структурировать информацию в одном файле используя синтаксис Markdown — приятнее именно исходный текст, а не результат, отображаемый на том же гитхабе...",
      "url": "https://habr.com/post/415865/?utm_source=habrahabr&utm_medium=rss&utm_campaign=415865",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Простые, но неочевидные, советы по подготовке доклада на крутую конференцию",
      "description": "В этом году мы, как никогда раньше, основательно подходим к работе над программой AppsConf — конференции для разработчиков мобильных приложений. Во-первых, у нас большой и классный программный комитет. Серьезно, чтобы в итоге отобрать около 60 докладов, 20 крутых профессионалов во всех мыслимых областях мобильной разработки работают с заявками уже с апреля месяца. Через их руки (глаза и уши на созвонах) уже прошло более 70 докладов, на основе которых сформировались некоторые советы о том, что для выступления хорошо, а что — плохо...",
      "url": "https://habr.com/company/oleg-bunin/blog/415775/?utm_source=habrahabr&utm_medium=rss&utm_campaign=415775",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Как работает JS: технология Shadow DOM и веб-компоненты",
      "description": "Сегодня, в переводе 17 части материалов, посвящённых особенностям всего, что так или иначе связано с JavaScript, речь пойдёт о веб-компонентах и о различных стандартах, которые направлены на работу с ними. Особое внимание здесь будет уделено технологии Shadow DOM...",
      "url": "https://habr.com/company/ruvds/blog/415881/?utm_source=habrahabr&utm_medium=rss&utm_campaign=415881",
      "attachment": "---",
      "tag": "22"
    },
    {
      "title": "10 мелких ошибок в дизайне, которые мы допускаем до сих пор",
      "description": "Поговорке «хороший дизайн — это дизайн, в котором все очевидно» сто лет в обед, и я уверен, что в каком-то виде она существовала и в прошлые века, применительно к хорошей еде, музыке, архитектуре, одежде, философии и вообще чему угодно...",
      "url": "https://habr.com/company/everydaytools/blog/416115/?utm_source=habrahabr&utm_medium=rss&utm_campaign=416115",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "САМЫЙ главный паттерн в программировании",
      "description": "Всем доброе время суток, я занимаюсь программированием уже 8 лет, причем программированием во всех его проявлениях: разработка серверной части на разных языках программирования, разработка клиентской части, программирование сетей, администрирование linux, оптимизации производительности. И когда такое долгое время занимаешь каким-либо делом, искренне его любишь и стремишься к саморазвитию, то неизбежно начинают прорисовываться различные причинно-следственные связи в соответствующей области, ты начинаешь видеть те взаимосвязи, о которых раньше даже не догадывался или попросту считал их незначительными, это собственно и является тем, что люди называют опытом...",
      "url": "https://habr.com/post/415895/?utm_source=habrahabr&utm_medium=rss&utm_campaign=415895",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Мои правила эффективности: работа с задачами, проектами, книгами и заметками",
      "description": "Самая важная вещь, которую я понял, проверив на себе десятки методик повышения эффективности: то, что ты делаешь, гораздо важнее того, когда и как. Без понимания этой вещи, применение даже самых изощренных техник ничего вам не даст...",
      "url": "https://habr.com/post/416083/?utm_source=habrahabr&utm_medium=rss&utm_campaign=416083",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Достоинства и недостатки Xamarin",
      "description": "Сегодня расскажем вам о том, что пользователям нравится в Xamarin, нашем инструменте для кросс-платформенной разработки мобильных приложений. Кроме того, затронем и недостатки платформы. Кстати, под катом вы найдете много кода и показательные примеры, а не только текст с перечислением. Присоединяйтесь...",
      "url": "https://habr.com/company/microsoft/blog/415833/?utm_source=habrahabr&utm_medium=rss&utm_campaign=415833",
      "attachment": "---",
      "tag": "2"
    },
    {
      "title": "Играем с потоками в Node.JS 10.5.0",
      "description": "У меня на работе возник спор между мной и дотнетчиками насчет потоков в новой версии Node.JS и необходимости их синхронизоровать. Для начала решили выбрать задачу о параллельной записи строк в файл. Тема с worker_threads горячая, прошу под кат. Немного о самих потоках. Они являются экспериментальной технологией в Node.JS 10.5.0, и для того, чтобы иметь доступ к модулю «worker_threads», необходимо запускать наше Node.JS приложение с флагом...",
      "url": "https://habr.com/post/416015/?utm_source=habrahabr&utm_medium=rss&utm_campaign=416015",
      "attachment": "---",
      "tag": "24"
    },
    {
      "title": "Разработка собственного фреймворка и профессиональный рост JS-программиста",
      "description": "Вы когда-нибудь задавались вопросом о том, как работают фреймворки? Автор материала, перевод которого мы сегодня публикуем, говорит, что когда он, много лет назад, после изучения jQuery, наткнулся на Angular.js, то, что он увидел, показалось ему очень сложным и непонятным. Потом появился Vue.js, и разбираясь с этим фреймворком, он вдохновился на написание собственной системы двусторонней привязки данных. Подобные эксперименты способствуют профессиональному росту программиста. Эта статья предназначена для тех, кто хочет расширить собственные знания в сфере технологий, на которых основаны современные JS-фреймворки. В частности, речь здесь пойдёт о том, как написать ядро собственного фреймворка, поддерживающего пользовательские атрибуты HTML-элементов, реактивность и двустороннюю привязку данных...",
      "url": "https://habr.com/company/ruvds/blog/416021/?utm_source=habrahabr&utm_medium=rss&utm_campaign=416021",
      "attachment": "---",
      "tag": "22"
    }
  ]
}