{
  "posts": [
    {
      "title": "Пятничный JS: случайное перемешивание",
      "description": "Всем привет. С ортодоксальной точки зрения сегодня не настоящая пятница — просто день, когда завтра выходной. Поэтому статья в моей традиционной рубрике тоже будет не совсем настоящая, у неё пониженный градус безумия и повышенная полезность. Однако довольно предисловий, перейдём к сути. Перед моими студентами регулярно встаёт задача случайного перемешивания массива. За её решением они, как правило, лезут в гугл. И гугл им подсказывает следующее...",
      "url": "https://habr.com/post/358094/",
      "attachment": "1.png",
      "tag": "22"
    },
    {
      "title": "Говорят и показывают сеньоры: обучение Junior Data Scientist",
      "description": "Как начать изучение Data Science? Что и где читать? Какие есть подводные камни, советы и уловки? Статья в помощь для Junior Data Scientist. Область Data Science очень обширна, ее довольно сложно изучить всю сразу. Нужно определиться с направлением, выбрать его и «штудировать»...",
      "url": "https://proglib.io/p/senior-says/",
      "attachment": "2.jpg",
      "tag": "2"
    },
    {
      "title": "Классические алгоритмы и структуры данных на JavaScript",
      "description": "Привет Всем! Я недавно запустил на GitHub проект JavaScript Algorithms and Data Structures, который содержит примеры классических алгоритмов и структур данных написанных на JavaScript с объяснениями, примерами и ссылками для дальнейшего изучения (в частности на соответствующие YouTube видео). Основная задача проекта — помочь программистам в изучении и применении алгоритмов и сделать это на JavaScript-е...",
      "url": "https://habr.com/post/359192/",
      "attachment": "3.png",
      "tag": "22"
    },
    {
      "title": "Полезные приёмы работы с массивами в JavaScript",
      "description": "В большинстве приложений, которые разрабатываются в наши дни, требуется взаимодействовать с некими наборами данных. Обработка элементов в коллекциях — это часто встречающаяся операция, с который вы, наверняка, сталкивались. При работе, например, с массивами, можно, не задумываясь, пользоваться обычным циклом for, который выглядит примерно так: for (var i=0; i < value.length; i++ ){}. Однако, лучше, всё-таки, смотреть на вещи шире...",
      "url": "https://habr.com/company/ruvds/blog/358306/",
      "attachment": "4.png",
      "tag": "22"
    },
    {
      "title": "Полезные методы массивов и объектов в JavaScript",
      "description": "Автор статьи, перевод которой мы сегодня публикуем, говорит, что её идею подсказал ему один из выпусков подкаста Syntax FM, в котором давался обзор полезных методов объектов и массивов в JavaScript. Эти методы помогают разработчикам писать чистый и читабельный код. Их применение снижает потребность в сторонних библиотеках наподобие Lodash...",
      "url": "https://habr.com/company/ruvds/blog/413169/",
      "attachment": "5.jpg",
      "tag": "22"
    },
    {
      "title": "Удобное логирование в SpringBoot + Log4j2 + Maven",
      "description": "Изложенный в статье материал предназначен для новичков и, возможно, как и мне сэкономит несколько часов поисков на StackOverFlow и других сайтах с целью получить удобную систему логирования, которая сама поймет куда логировать — в консоль, файл или logstash. На старте проекта всегда возникает задача правильно настроить логирование, при этом на локальном окружении логи должны выводиться в консоль и в файл для удобства в процессе отладки, а на удаленном сервере выводить логи в консоль крайне не желательно, но вместо этого их надо писать в файл, logstash или в БД. А если у вас локально Windows, а на удаленной машине Linux, то отличается и адрес расположения этого файла с логами. Таким образом возникает немало ситуаций, в которых нужно руками постоянно править конфигурацию системы логирования в зависимости от внешних обстоятельств...",
      "url": "https://habr.com/post/413091/",
      "attachment": "6.jpg",
      "tag": "17"
    },
    {
      "title": "Странные операторы в PHP",
      "description": "Если вы прочитаете документацию по PHP, вы узнаете о массе операторов. Если вы не знаете ещё PHP-операторы, сперва изучите их, а потом вернитесь к прочтению этой статьи. Операторы обычно состоят из странных символов, таких как !, -, =>, <=>, ^ or ~. Действительно, некоторые из них просто читаются, например AND, в то время как некоторые из них — упущенная попытка сделать их читаемыми и скрыть их фактически двойную индивидуальность, например, xor. Вероятно, вы думаете, что знаете документацию PHP вдоль и поперёк, но всегда найдётся, чему поучиться. Поэтому я глубоко погрузился в код ядра PHP и посмотрел некоторые особенные операторы PHP, менее известные, но очень полезные в ежедневной работе...",
      "url": "https://habr.com/post/412603/",
      "attachment": "7.png",
      "tag": "14"
    },
    {
      "title": "Релиз YouTrack 2018.2: новая страница проектов, Docker-образ YouTrack и многое другое",
      "description": "Всем привет! Мы выпустили новую версию системы управления проектами — YouTrack 2018.2 — и спешим поделиться с вами нововведениями. Что нового в YouTrack 2018.2?...",
      "url": "https://habr.com/company/JetBrains/blog/412831/",
      "attachment": "8.png",
      "tag": "2"
    },
    {
      "title": "Автоматическая визуализация python-кода. Часть третья: новые возможности графического представления кода",
      "description": "В третьей части статьи речь пойдет о новых возможностях графического представления кода. Со времени написания второй части был добавлен интерфейс для смены цветов, используемых для отображения графических примитивов и интерфейс для смены текста, демонстрируемого графическим примитивом. В обоих случаях интерфейс минималистичен и использует контекстное меню...",
      "url": "https://habr.com/post/358826/",
      "attachment": "9.jpg",
      "tag": "16"
    },
    {
      "title": "Мониторинг JavaScript-ошибок с помощью window.onerror",
      "description": "Материал, перевод которого мы сегодня публикуем, посвящён обработке JS-ошибок с помощью window.onerror. Это — особое событие браузера, которое вызывается при появлении неперехваченных ошибок. Здесь мы поговорим о том, как перехватывать ошибки с помощью обработчика события onerror, и о том, как отправлять сведения о них на сервер разработчика веб-сайта. Этот обработчик можно использовать в качестве основы собственной системы сбора и анализа информации об ошибках. Кроме того, он является одним из важнейших механизмов, применяемых в библиотеках, ориентированных на работу с ошибками, таких, как raven-js...",
      "url": "https://habr.com/company/ruvds/blog/413173/",
      "attachment": "10.jpg",
      "tag": "22"
    },
    {
      "title": "Правостороннее присваивание и другие необычные приёмы программирования в C#",
      "description": "В этой статье будут рассмотрены с нового ракурса такие привычные и фундаментальные вещи, как присваивание и передача параметров в методы. Вероятно, предлагаемые решения поначалу покажутся несколько странными и надуманными, но прелесть их раскроется чуть позже, когда станет видна вся картина целиком. Будет много нового и интересного, возможно, даже полезного. А после прочтения каждый сам сможет решить, стоит ли ему применять описанные техники в дальнейшей повседневной практике...",
      "url": "https://habr.com/post/354278/",
      "attachment": "11.jpg",
      "tag": "18"
    },
    {
      "title": "Создание, настройка и использование собственного Git-сервера",
      "description": "Материал, перевод которого мы сегодня публикуем, посвящён настройке Git-серверов. Git — это система управления версиями, разработанная Линусом Торвальдсом. Git пользуются миллионы людей во всём мире. Компании, вроде GitHub, предлагают службы хостинга кода, основанные на Git. По информации, которую можно найти в различных публикациях, GitHub является крупнейшим сервисом для хостинга IT-проектов. В частности, в 2017-м году сообщество GitHub достигло 24 миллионов разработчиков, которые трудятся над 67 миллионами репозиториев. В наши дни GitHub пользуются абсолютно все — от программистов-одиночек, до крупных организаций. Надо сказать, что даже компания Google перешла на GitHub, закрыв собственный проект схожей направленности...",
      "url": "https://habr.com/company/ruvds/blog/359216/",
      "attachment": "12.png",
      "tag": "23"
    },
    {
      "title": "Как быстро и эффективно работать с приоритетами по методу Lean Prioritization?",
      "description": "Постоянная работа с приоритетами является необходимостью в управлении продуктами, неотъемлемой частью процесса разработки. Если хватает времени, можно изучить и попробовать использовать сложные и интересные методы для определения приоритетов. Техника Lean Prioritization — один из простых и доступных подходов, который помогает менеджерам продуктов управлять бэклогом задач, особенно, когда нужно это сделать быстро и эффективно...",
      "url": "https://habr.com/company/hygger/blog/359208/",
      "attachment": "13.jpg",
      "tag": "2"
    }
  ]
}