{
  "posts": [
    {
      "title": "Пятничный JS: случайное перемешивание",
      "description": "Всем привет. С ортодоксальной точки зрения сегодня не настоящая пятница — просто день, когда завтра выходной. Поэтому статья в моей традиционной рубрике тоже будет не совсем настоящая, у неё пониженный градус безумия и повышенная полезность. Однако довольно предисловий, перейдём к сути. Перед моими студентами регулярно встаёт задача случайного перемешивания массива. За её решением они, как правило, лезут в гугл. И гугл им подсказывает следующее...",
      "url": "https://habr.com/post/358094/",
      "attachment": "1.png",
      "tag": "22"
    },
    {
      "title": "Говорят и показывают сеньоры: обучение Junior Data Scientist",
      "description": "Как начать изучение Data Science? Что и где читать? Какие есть подводные камни, советы и уловки? Статья в помощь для Junior Data Scientist. Область Data Science очень обширна, ее довольно сложно изучить всю сразу. Нужно определиться с направлением, выбрать его и «штудировать»...",
      "url": "https://proglib.io/p/senior-says/",
      "attachment": "2.jpg",
      "tag": "2"
    },
    {
      "title": "Классические алгоритмы и структуры данных на JavaScript",
      "description": "Привет Всем! Я недавно запустил на GitHub проект JavaScript Algorithms and Data Structures, который содержит примеры классических алгоритмов и структур данных написанных на JavaScript с объяснениями, примерами и ссылками для дальнейшего изучения (в частности на соответствующие YouTube видео). Основная задача проекта — помочь программистам в изучении и применении алгоритмов и сделать это на JavaScript-е...",
      "url": "https://habr.com/post/359192/",
      "attachment": "3.png",
      "tag": "22"
    },
    {
      "title": "Полезные приёмы работы с массивами в JavaScript",
      "description": "В большинстве приложений, которые разрабатываются в наши дни, требуется взаимодействовать с некими наборами данных. Обработка элементов в коллекциях — это часто встречающаяся операция, с который вы, наверняка, сталкивались. При работе, например, с массивами, можно, не задумываясь, пользоваться обычным циклом for, который выглядит примерно так: for (var i=0; i < value.length; i++ ){}. Однако, лучше, всё-таки, смотреть на вещи шире...",
      "url": "https://habr.com/company/ruvds/blog/358306/",
      "attachment": "4.png",
      "tag": "22"
    },
    {
      "title": "Полезные методы массивов и объектов в JavaScript",
      "description": "Автор статьи, перевод которой мы сегодня публикуем, говорит, что её идею подсказал ему один из выпусков подкаста Syntax FM, в котором давался обзор полезных методов объектов и массивов в JavaScript. Эти методы помогают разработчикам писать чистый и читабельный код. Их применение снижает потребность в сторонних библиотеках наподобие Lodash...",
      "url": "https://habr.com/company/ruvds/blog/413169/",
      "attachment": "5.jpg",
      "tag": "22"
    },
    {
      "title": "Удобное логирование в SpringBoot + Log4j2 + Maven",
      "description": "Изложенный в статье материал предназначен для новичков и, возможно, как и мне сэкономит несколько часов поисков на StackOverFlow и других сайтах с целью получить удобную систему логирования, которая сама поймет куда логировать — в консоль, файл или logstash. На старте проекта всегда возникает задача правильно настроить логирование, при этом на локальном окружении логи должны выводиться в консоль и в файл для удобства в процессе отладки, а на удаленном сервере выводить логи в консоль крайне не желательно, но вместо этого их надо писать в файл, logstash или в БД. А если у вас локально Windows, а на удаленной машине Linux, то отличается и адрес расположения этого файла с логами. Таким образом возникает немало ситуаций, в которых нужно руками постоянно править конфигурацию системы логирования в зависимости от внешних обстоятельств...",
      "url": "https://habr.com/post/413091/",
      "attachment": "6.jpg",
      "tag": "17"
    },
    {
      "title": "Странные операторы в PHP",
      "description": "Если вы прочитаете документацию по PHP, вы узнаете о массе операторов. Если вы не знаете ещё PHP-операторы, сперва изучите их, а потом вернитесь к прочтению этой статьи. Операторы обычно состоят из странных символов, таких как !, -, =>, <=>, ^ or ~. Действительно, некоторые из них просто читаются, например AND, в то время как некоторые из них — упущенная попытка сделать их читаемыми и скрыть их фактически двойную индивидуальность, например, xor. Вероятно, вы думаете, что знаете документацию PHP вдоль и поперёк, но всегда найдётся, чему поучиться. Поэтому я глубоко погрузился в код ядра PHP и посмотрел некоторые особенные операторы PHP, менее известные, но очень полезные в ежедневной работе...",
      "url": "https://habr.com/post/412603/",
      "attachment": "7.png",
      "tag": "14"
    },
    {
      "title": "Релиз YouTrack 2018.2: новая страница проектов, Docker-образ YouTrack и многое другое",
      "description": "Всем привет! Мы выпустили новую версию системы управления проектами — YouTrack 2018.2 — и спешим поделиться с вами нововведениями. Что нового в YouTrack 2018.2?...",
      "url": "https://habr.com/company/JetBrains/blog/412831/",
      "attachment": "8.png",
      "tag": "2"
    },
    {
      "title": "Автоматическая визуализация python-кода. Часть третья: новые возможности графического представления кода",
      "description": "В третьей части статьи речь пойдет о новых возможностях графического представления кода. Со времени написания второй части был добавлен интерфейс для смены цветов, используемых для отображения графических примитивов и интерфейс для смены текста, демонстрируемого графическим примитивом. В обоих случаях интерфейс минималистичен и использует контекстное меню...",
      "url": "https://habr.com/post/358826/",
      "attachment": "9.jpg",
      "tag": "16"
    },
    {
      "title": "Мониторинг JavaScript-ошибок с помощью window.onerror",
      "description": "Материал, перевод которого мы сегодня публикуем, посвящён обработке JS-ошибок с помощью window.onerror. Это — особое событие браузера, которое вызывается при появлении неперехваченных ошибок. Здесь мы поговорим о том, как перехватывать ошибки с помощью обработчика события onerror, и о том, как отправлять сведения о них на сервер разработчика веб-сайта. Этот обработчик можно использовать в качестве основы собственной системы сбора и анализа информации об ошибках. Кроме того, он является одним из важнейших механизмов, применяемых в библиотеках, ориентированных на работу с ошибками, таких, как raven-js...",
      "url": "https://habr.com/company/ruvds/blog/413173/",
      "attachment": "10.jpg",
      "tag": "22"
    },
    {
      "title": "Правостороннее присваивание и другие необычные приёмы программирования в C#",
      "description": "В этой статье будут рассмотрены с нового ракурса такие привычные и фундаментальные вещи, как присваивание и передача параметров в методы. Вероятно, предлагаемые решения поначалу покажутся несколько странными и надуманными, но прелесть их раскроется чуть позже, когда станет видна вся картина целиком. Будет много нового и интересного, возможно, даже полезного. А после прочтения каждый сам сможет решить, стоит ли ему применять описанные техники в дальнейшей повседневной практике...",
      "url": "https://habr.com/post/354278/",
      "attachment": "11.jpg",
      "tag": "18"
    },
    {
      "title": "Создание, настройка и использование собственного Git-сервера",
      "description": "Материал, перевод которого мы сегодня публикуем, посвящён настройке Git-серверов. Git — это система управления версиями, разработанная Линусом Торвальдсом. Git пользуются миллионы людей во всём мире. Компании, вроде GitHub, предлагают службы хостинга кода, основанные на Git. По информации, которую можно найти в различных публикациях, GitHub является крупнейшим сервисом для хостинга IT-проектов. В частности, в 2017-м году сообщество GitHub достигло 24 миллионов разработчиков, которые трудятся над 67 миллионами репозиториев. В наши дни GitHub пользуются абсолютно все — от программистов-одиночек, до крупных организаций. Надо сказать, что даже компания Google перешла на GitHub, закрыв собственный проект схожей направленности...",
      "url": "https://habr.com/company/ruvds/blog/359216/",
      "attachment": "12.png",
      "tag": "23"
    },
    {
      "title": "Как быстро и эффективно работать с приоритетами по методу Lean Prioritization?",
      "description": "Постоянная работа с приоритетами является необходимостью в управлении продуктами, неотъемлемой частью процесса разработки. Если хватает времени, можно изучить и попробовать использовать сложные и интересные методы для определения приоритетов. Техника Lean Prioritization — один из простых и доступных подходов, который помогает менеджерам продуктов управлять бэклогом задач, особенно, когда нужно это сделать быстро и эффективно...",
      "url": "https://habr.com/company/hygger/blog/359208/",
      "attachment": "13.jpg",
      "tag": "2"
    },
    {
      "title": "Чего стоит самое точное расписание электричек с 2003 года",
      "description": "Расписание электричек — это то, с чего в 2003 году начинался Туту.ру. Сейчас я с гордостью могу сказать, что наше расписание иногда оказывается более точным, чем расписание перевозчика или РЖД, — это потому что мы очень быстро реагируем на обращения пассажиров и имеем эвристики для сравнения разных источников данных и их взаимокоррекций. Началось всё так. Изначально в Интернете не было регулярно обновляемого расписания электричек. Точнее, было «бумажное». Просто сохранить расписание с вокзала или опубликовать то, что обычно размещают в разных брошюрках, — это бесполезно. В расписание вносится большое число временных изменений. Мы поставили цель — сделать регулярно обновляемое расписание...",
      "url": "https://habr.com/company/tuturu/blog/413321/",
      "attachment": "14.jpg",
      "tag": "2"
    },
    {
      "title": "Как напечатать бейджи для компании и не умереть",
      "description": "Людям сложнее начать общаться, когда они не знают, как друг к другу обратиться. Незнакомца не спросишь, сколько в его продукте страниц осталось перевести на webpack и кто у него скрам-мастер. За последние пару лет у нас стало слишком много людей, чтобы все могли познакомиться, пересекаясь время от времени на кухне. Задача создать бейджи — про коммуникацию. Когда видишь, как зовут собеседника, легче начать разговор. А ещё про безопасность — бейджи помогают отличать сотрудников от гостей. Расскажу, как мы справились с этой задачей и что вам непременно нужно знать, если когда-то решитесь повторить наш опыт...",
      "url": "https://habr.com/company/tuturu/blog/359164/",
      "attachment": "15.jpg",
      "tag": "2"
    },
    {
      "title": "Вредные советы: как превратить автоматизацию UI-тестов в кошмар",
      "description": "Есть много способов усложнить жизнь командам автоматизации тестирования. Если вы разработчик или системный архитектор, и недолюбливаете кого-то из тестировщиков, то эта статья — для вас. Вы найдете в ней сокровенное знание, вдохновившись которым, вы научитесь делать интерфейс любого приложения практически непригодным для тестирования. Ну, а если вы добрая душа и уважительно относитесь к чужому труду, то можете рассматривать эту статью как набор антипаттернов...",
      "url": "https://habr.com/company/badoo/blog/359238/",
      "attachment": "16.jpg",
      "tag": "2"
    },
    {
      "title": "15 советов по работе с Github",
      "description": "Я 10 лет разрабатываю ПО, участвовал в нескольких open source-проектах и в многочисленных не-open source-проектах, работал в больших и малых командах, и везде мы использовали Github в качестве репозитория версионирования. За это время я перепробовал разные рабочие процессы, и хочу поделиться советами, как построить эффективный и прагматичный рабочий процесс по созданию и сопровождению качественного ПО, который можно применять в любом проекте...",
      "url": "https://habr.com/company/mailru/blog/359246/",
      "attachment": "17.png",
      "tag": "23"
    },
    {
      "title": "Как обучать джуниоров внутри компании: опыт компании Lodoss Team",
      "description": "Антон Репьев, технический директор Lodoss Team, специально для блога Нетологии поделился кейсом, как внутри компании организовать программу стажировки и вырастить с нуля молодых специалистов. Кадровый голод — вечная проблема IT-компаний. Все решают её по-своему: кто-то прокачивает HR-бренд и хантит кандидатов в LinkedIn, кто-то воспитывает своих разработчиков с нуля. Мы в Lodoss Team выбрали второй путь. Я разработал тренинг для начинающих специалистов и курирую обучение стажеров в компании. Что из этого получилось и зачем нам это надо, читайте в этой статье...",
      "url": "https://habr.com/company/netologyru/blog/358986/",
      "attachment": "18.jpg",
      "tag": "2"
    },
    {
      "title": "Как нашего заказчика не хотел отпускать провайдер",
      "description": "История довольно короткая, но смешная. С ней реально столкнулся наш заказчик. Началось всё в тот момент, когда один из провайдеров ИТ-инфраструктуры решил перевезти свой дата-центр. И предупредил примерно за полгода всех своих клиентов о трёхдневном даунтайме, но так тянул время и организовывал бюрократическую волокиту, что некоторые заказчики к миграции попросту не успели подготовиться. Представьте: вы CIO. Бюджета на аварийную дублирующую площадку у вас нет. Старого оборудования тоже нет. Бизнес связан с предоставлением медицинских услуг, здесь каждый лишний час промедления стоит дорого: один день простоя грозит финансовыми и имиджевыми потерями, равными годовой прибыли, два часа — начнут страдать клиенты...",
      "url": "https://habr.com/company/croccloudteam/blog/359190/",
      "attachment": "19.jpeg",
      "tag": "2"
    },
    {
      "title": "10 (не) очевидных советов начинающим WEB-разработчикам",
      "description": "В интернете уже есть полно книг, статей, да и тех же постов на хабре для начинающих. Но, как по мне, то существует ряд нюансов которые обычно или вообще не упоминаются (видимо, их считают очевидными), либо же упоминаются очень редко. И это не советы из серии «изучайте код других разработчиков», «используйте git», «делайте бекапы» или «мойте руки перед походом в production-консоль». Это обыденные, практические вещи, которые приходят с некоторым опытом. Часть из них не пригодится если вы используете самые современные подходы к разработке, часть из них универсальны. Конкретно в этом посте выражен опыт PHP разработчика, но на самом деле множество пунктов подходят и к другим стекам разработки. Если вы начинающий веб-разработчик — добро пожаловать под кат, Senior-ы вряд ли найдут там для себя что-то новое...",
      "url": "https://habr.com/post/359168/",
      "attachment": "20.png",
      "tag": "2"
    },
    {
      "title": "Опыт создания мобильного приложения: получилось не с первого раза ",
      "description": "Только что мы закончили наш цикл статей по квантовому программированию. Теперь ненадолго вернемся к более понятному — мобильной разработке, и в серии из нескольких статей поговорим о конструкторе для разработки мобильных приложений для интернет-магазинов. Это уже вторая попытка ребят создать такой конструктор и теперь она успешна. Заряжайтесь опытом под катом...",
      "url": "https://habr.com/company/microsoft/blog/354870/",
      "attachment": "21.png",
      "tag": "2"
    },
    {
      "title": "11 лучших шрифтов для программирования",
      "description": "Много статей и сайтов сравнивают шрифты для программирования — всё это отличные ресурсы. Так зачем я опять поднимаю эту тему? Потому что сам всегда терялся в десятках шрифтов и не мог понять, какой лучше. Так что я опробовал много шрифтов и выбрал следующие для вас. Они довольно популярны и их легко получить. И самое главное, все эти шрифты бесплатны! Я ранжировал шрифты по следующим показателям...",
      "url": "https://habr.com/post/358992/",
      "attachment": "22.jpg",
      "tag": "2"
    },
    {
      "title": "Java и Linux — особенности эксплуатации",
      "description": "Java — очень распространённая платформа, на ней пишут очень разные вещи, начиная от Big Data, заканчивая микросервисами, монолитами, enterprise и прочим. И, как правило, всё это развёртывают на Linux серверах. При этом, соответственно, те люди, которые пишут на Java, зачастую делают это совсем на других операционных системах. Там они...",
      "url": "https://habr.com/company/oleg-bunin/blog/358520/",
      "attachment": "23.png",
      "tag": "17"
    },
    {
      "title": "JavaScript ES6: пишем меньше — делаем больше",
      "description": "Стандарт ES6 принёс в мир JavaScript-разработки новые синтаксические конструкции и замечательные возможности, которые, кроме прочего, улучшают читаемость текстов программ, позволяют сделать их лаконичнее и выразительнее. Всё это позволяет разработчику решать те же задачи, что и раньше, написав меньше кода. «Пишем меньше — делаем больше», — это идея, которая вдохновила автора материала, перевод которого мы сегодня публикуем, на исследование возможностей ES6. В частности, здесь он сравнивает ES5 и ES6 и рассматривает варианты практического использования новых конструкций...",
      "url": "https://habr.com/company/ruvds/blog/354280/",
      "attachment": "24.jpg",
      "tag": "22"
    },
    {
      "title": "Женские сети: кто делает за нас выбор?",
      "description": "Взлет интереса к машинному обучению во многом связан с тем, что модели способны дать ощутимый прирост прибыли в областях, связанных с предсказанием поведения сложных систем. В частности, той сложной системой, чье поведение предсказывать выгодно, является человек. Обнаружить мошенничество на ранней стадии, выявить склонность клиентов к оттоку – эти задачи возникают регулярно и уже стали классическими в Data Science. Безусловно, их можно решать различными методами, в зависимости от пристрастий конкретного специалиста и от требований бизнеса. У нас была возможность использовать нейронные сети для решения задачи по предсказанию поведения людей, а специфика области применения была связана с индустрией красоты. Основной аудиторией для “опытов” стали женщины. Мы по сути пришли к вопросу: может ли искусственная нейронная сеть понять настоящую нейронную сеть (человека) в той области, в которой даже сам человек еще не осознал своего поведения. Как мы ответили на этот вопрос и что у нас получилось в итоге, можно узнать далее...",
      "url": "https://habr.com/company/lanit/blog/358238/",
      "attachment": "25.jpg",
      "tag": "2"
    },
    {
      "title": "Расширения для VS Code и программирование на JavaScript",
      "description": "Одно из важнейших условий для продуктивной работы веб-программиста — хорошо настроенный редактор кода. Один из них — опенсорсный универсальный редактор Visual Studio Code, который замечателен не только тем, что он бесплатен, но и тем, как много полезного он умеет сразу после установки и минимальной настройки. Если речь идёт о том, чтобы использовать VS Code в какой-то конкретной сфере, вроде разработки на JavaScript, обычно стоит дополнить его несколькими расширениями, которые повышают производительность труда и упрощают жизнь программиста. Вокруг VS Code сложилось активное сообщество разработчиков расширений. Эти расширения легко искать и ещё легче устанавливать...",
      "url": "https://habr.com/company/ruvds/blog/354960/",
      "attachment": "26.png",
      "tag": "22"
    },
    {
      "title": "Книга «Теоретический минимум по Computer Science. Все что нужно программисту и разработчику»",
      "description": "Хватит тратить время на скучные академические фолианты! Изучение Computer Science может быть веселым и увлекательным занятием. Владстон Феррейра Фило знакомит нас с вычислительным мышлением, позволяющим решать любые сложные задачи. Научиться писать код просто — пара недель на курсах, и вы «программист», но чтобы стать профи, который будет востребован всегда и везде, нужны фундаментальные знания. Здесь вы найдете только самую важную информацию, которая необходима каждому разработчику и программисту каждый день...",
      "url": "https://habr.com/company/piter/blog/358610/",
      "attachment": "27.jpg",
      "tag": "2"
    },
    {
      "title": "Дизайнеры и разработчики: заклятые друзья и лучшие враги",
      "description": "В посте я разберу не новую, но всегда актуальную тему — взаимоотношения дизайнера и фронтенд-разработчика. Статья пригодится новичкам и командам, у которых еще не выстроены процессы работы. Рассмотрим несколько примеров из жизни и попробуем разобраться, как избежать разногласий...",
      "url": "https://habr.com/company/sberbank/blog/354788/",
      "attachment": "28.jpg",
      "tag": "2"
    },
    {
      "title": "И да пребудет с тобой сила: как юному падавану правильно стажироваться в IT",
      "description": "Найти на рынке труда хороших ИТ-специалистов, привлечь их в свою компанию и удержать – задачи, стоящие перед ИТ-компаниями особенно остро в последние годы. На талантливую молодежь открыта настоящая охота, и эпизод с уходом Гилфоя в Silicon Valley кажется все менее смешным HR-ам. Российские компании, столкнувшиеся с нехваткой квалифицированных кадров на рынке, начинают «выращивать» таланты: привлекать их в компанию еще студентами или вчерашними выпускниками и развивать внутри команды. Как извлечь из этого выгоду молодым программистам...",
      "url": "https://tproger.ru/articles/find-your-way-through-it-industry/",
      "attachment": "29.jpg",
      "tag": "2"
    },
    {
      "title": "Мифы о кэше процессора, в которые верят программисты",
      "description": "Как компьютерный инженер, который пять лет занимался проблемами кэша в Intel и Sun, я немного разбираюсь в когерентности кэша. Это одна из самых трудных концепций, которые пришлось изучить ещё в колледже. Но как только вы действительно её освоили, то приходит гораздо лучшее понимание принципов проектирования систем...",
      "url": "https://habr.com/post/354748/",
      "attachment": "30.jpg",
      "tag": "2"
    },
    {
      "title": "Исследования показывают: люди, у которых «чересчур много интересов» имеют больше шансов на успех",
      "description": "Предостережение против универсализма сохранилось в многовековой истории десятков языков. «У него каких только ножей нет — и ни одного острого», — предупреждают китайцы. А в Эстонии есть поговорка «девять ремесел, и голод — десятое». Однако, многие из наиболее неординарных личностей — как живших в прошлом, так и наших современников — были универсалами: таковы Илон Маск, Стив Джобс, Ричард Фейнман, Бенджамин Франклин, Томас Эдисон, Леонардо да Винчи и Мария Кюри — список далеко не полон...",
      "url": "https://habr.com/company/alconost/blog/354822/",
      "attachment": "31.jpg",
      "tag": "2"
    },
    {
      "title": "Метод фрактального многообразия в задачах Data Science",
      "description": "Получен критерий (SNR), отличающий функцию Гаусса, распределение случайных величин в отсутствии взаимной корреляции, от других функций, что делает возможным описание коллективных состояний с сильной взаимной корреляцией данных. Определяется отношение сигнала к шуму (SNR) в одномерном пространстве и приводится алгоритм вычисления, основанный на фрактальном многообразии фрактала пыль Кантора в замкнутом контуре. Алгоритм инвариантен относительно любых линейных преобразований исходного набора данных, обладает ренормгрупповой инвариантностью и определяет степень взаимной корреляции данных с учётом окрестности или коллективный эффект. Описание коллективного состояния носит универсальный характер и не зависит от природы корреляции данных, как и универсальность распределения случайных величин в отсутствии корреляции данных. Метод применим для больших наборов негауссовых или странных данных, полученных в информационных технологиях. В подтверждении гипотезы Кошланда, применение метода к данным интенсивности цифровых спектров рентгеноструктурного анализа с вычислением коллективного эффекта позволяет выделить конформер, проявляющий биологическую активность...",
      "url": "https://habr.com/post/354898/",
      "attachment": "32.png",
      "tag": "2"
    },
    {
      "title": "Почему создание простенького превью по ссылкам в Википедии заняло четыре года",
      "description": "Несколько дней назад моя команда запустила функцию «предварительного просмотра страниц» (превью) в сотнях языковых версий Википедии. Наш API ежеминутно обрабатывает до полумиллиона вызовов для выдачи карточек превью, которые отображаются при наведении курсора на любую ссылку. На первый взгляд всё очень просто. Такое есть на многих сайтах. На карточке размещается изображение и немного текста — и она отображается при наведении курсора на ссылку. Ничего инновационного… по крайней мере, так может показаться на первый взгляд...",
      "url": "https://habr.com/post/354236/",
      "attachment": "33.png",
      "tag": "2"
    },
    {
      "title": "10000 лайков",
      "description": "В самом начале января coin и я бродили по холодным и дождливым улицам Лондона и говорили о технологиях, жизни и чём-то ещё. Я время от времени делал фотографии на свой старый Canon EOS 400D, и в какой-то момент мой друг сказал: “Вот ты фотографируешь, фотографируешь, а твои фотографии никто не лайкает”. Я не нашёл что ответить, но вернувшись домой, создал аккаунт в одной из соцсетей, где можно постить и лайкать фотографии, и составил план: за 100 дней набрать 10000 фолловеров и к концу этого срока получать 500 лайков за пост. После этого отобрал пару сотен интересных фотографий и запостил первую. И её лайкнуло только несколько человек. Этого было мало, нужно было придумать какой-то метод...",
      "url": "https://habr.com/post/354008/",
      "attachment": "34.jpeg",
      "tag": "2"
    },
    {
      "title": "Добро пожаловать в Hypothesis!",
      "description": "Hypothesis представляет собой библиотеку Python для создания модульных тестов, которые попроще писать и более эффективны при запуске, обнаруживая граничные случаи в коде, который вы бы не подумали искать. Он стабильный, мощный и легко добавляется в любой существующий набор тестов. Алгоритм его работы, позволяя вам писать тесты, которые утверждают, что что-то должно быть истинным для каждого случая, а не только то, о чём вы догадались подумать. Нормальный модульный тест — это что-то вроде следующего...",
      "url": "https://habr.com/post/354134/",
      "attachment": "35.png",
      "tag": "16"
    },
    {
      "title": "Продакт и проджект — в чём разница? Мнения руководителей сервисов Яндекса",
      "description": "С ростом сервиса почти всегда нужно более подробно расписывать роли в команде. Когда все участники процесса понимают специализацию друг друга, то сразу видят, кому какие вопросы задавать и каких компетенций недостаёт для развития. Поэтому если маленькому сервису нужен просто менеджер, то в более крупных фигурируют две роли: менеджера продукта и менеджера проектов. На сленге технологических компаний, сплошь состоящем из англицизмов, говорят иначе — продакт- и проджект-менеджер. Это может быть один и тот же человек — подобно тому, как разработчик может заниматься фронтендом и бэкендом одновременно...",
      "url": "https://habr.com/company/yandex/blog/352098/",
      "attachment": "36.jpg",
      "tag": "2"
    },
    {
      "title": "Асинхронные циклы и Stream API в Node.js 10",
      "description": "В этом месяце выходит десятая версия Node.js, в которой нас ждет изменение поведения потоков (readable-stream), вызванное появлением асинхронных циклов for-await-of. Давайте разберемся что это такое и к чему нам готовиться...",
      "url": "https://habr.com/post/353886/",
      "attachment": "37.png",
      "tag": "22"
    },
    {
      "title": "Записки о миграции на Java 10",
      "description": "Как ты помнишь, недавно произошёл официальный релиз Java 10. Учитывая, что практически все сейчас используют преимущественно 8-ку, с выходом 10-ки нас ждут такие вкусности как модульность (вошла в 9-ку) и local variable type inference. Звучит неплохо, можно попробовать поэкспериментировать с переносом какого-нибудь существующего проекта на 10-ку...",
      "url": "https://habr.com/post/354114/",
      "attachment": "38.png",
      "tag": "17"
    },
    {
      "title": "Go: Хороший, плохой, злой",
      "description": "У Go есть некоторые замечательные свойства, которым посвящён раздел «Хороший». Но когда речь заходит о применении этого языка не для создания API или сетевых серверов (для чего он и был разработан), а для реализации бизнес-логики, то я считаю Gо слишком неуклюжим и неудобным. Хотя даже в рамках сетевого программирования найдётся немало подводных камней как в архитектуре языка, так и в реализации, что делает Go опасным, несмотря на его кажущуюся простоту...",
      "url": "https://habr.com/company/mailru/blog/353790/",
      "attachment": "39.png",
      "tag": "25"
    },
    {
      "title": "Как я проходил тестовое задание на летнюю стажировку в Яндекс",
      "description": "Cегодня я расскажу о том, как я проходил тестовое задание на летнюю стажировку в Яндекс. Эта публикация будет полезна начинающим разработчикам, любителям олимпиадного программирования, тем кто неравнодушен к С++ и Java, или просто хочет прочесть интересную статью после трудного рабочего дня. Чего ожидать от этой статьи...",
      "url": "https://habr.com/post/353662/",
      "attachment": "40.jpg",
      "tag": "2"
    },
    {
      "title": "Архитектура кода",
      "description": "В этой статье я хочу поделиться своим личным опытом, связанным с правильной организацией кода (архитектурой). Правильная архитектура существенно упрощает долгосрочную поддержку. Это очень философская тема, поэтому я не могу предложить ничего более, чем мой субъективный анализ и опыт...",
      "url": "https://habr.com/post/353698/",
      "attachment": "41.jpg",
      "tag": "2"
    },
    {
      "title": "Верстаем flex-календарик",
      "description": "Идет 2018 год, модные пацаны давно уже верстают на grid, а я все на третьем бутстрапе сижу с col-md кочерячусь, мельком поглядывая на четвертый. Решил я, что это не дело, и стоит немного знания освежить, но у grid вроде как поддержка пока хромает, а вот flex технологию уже даже утюги поддерживают. Вот и решил его освоить. И процессом усвоения с вами поделится. В общем, будем верстать календарик на весь год...",
      "url": "https://habr.com/post/353664/",
      "attachment": "42.jpg",
      "tag": "2"
    },
    {
      "title": "JavaScript, Java, какая теперь разница?",
      "description": "В чем проблема? В повседневной практике часто встречаются приложения, состоящие из двух частей: JavaScript-фронтенд и Java-бэкенд. Организация интеропа между ними требует усилий. Как правило, делают их люди с разных сторон баррикад, и при попытке залезть в чужую область они начинают страдать. Еще есть фуллстек веб-разработчики, но про них всё понятно: они должны страдать всегда. В этой статье мы рассмотрим новую технологию, которая может сделать процесс немного менее болезненным. Точнее, способ существует довольно давно, но как-то прошел мимо внимания широких народных масс. Если кто-то из джавистов еще не писал на React, то здесь будет туториал, позволяющий это сделать. Если кто-то из джаваскриптеров не пробовал писать на Java, то в этом же туториале получится к ней прикоснуться (правда, всего одной строчкой и сквозь JS-биндинги)...",
      "url": "https://habr.com/company/jugru/blog/353624/",
      "attachment": "43.png",
      "tag": "22"
    },
    {
      "title": "Thunkable X – бесплатная браузерная среда разработки мобильных приложений под iOS и Android",
      "description": "IDE Thunkable X работает на платформе Thunkable, которая ранее развивалась в качестве альтернативы MIT App Inventor. В настоящее время платформа предлагает две функционально отличающиеся и независимые среды разработки – оригинальную для разработки под Android, совместимую с MIT App Inventor, и кроссплатформенную Thunkable X, позволяющую один и тот же проект запустить и на iOS, и на Android. Более того, данная IDE предоставляет возможность установить на каждый iPhone по одному приложению без использования стороннего аппаратного и программного обеспечения. Не требуется ни компьютер Mac, ни эмулятор macOS, ни Xcode, ни джейлбрейк и др...",
      "url": "https://habr.com/post/353584/",
      "attachment": "44.png",
      "tag": "2"
    },
    {
      "title": "Красивый листинг файлов и директорий в nginx",
      "description": "Для web-сервера Apache существует множество инструкций, в том числе и на Хабре, как стилизовать стандартный листинг файлов и директорий. Однако, как сделать также для сервера nginx, в русскоязычном интернете не найти. Порывшись на просторах интернета я нашел один репозитарий, где как раз и решается этот вопрос. Но для кириллических наименований файлов и папок потребовалась небольшая работа напильником...",
      "url": "https://m.habrahabr.ru/post/353478/",
      "attachment": "45.jpg",
      "tag": "13"
    },
    {
      "title": "Литературный архиватор",
      "description": "Прежде всего, поздравляю всех православных и им сочувствующих с пасхой и окончанием великого поста, всех остальных — с наступлением весны. В песочнице только месяц назад наконец утонул мой дебют про программирование на кириллице. Не знаю, что привлекло внимание читателей к зелени, но комментировали простынями, как настоящую статью. В своей простыне TrllServ предложил использовать задумку для архивации. Обожаю людей, которые умеют находить практическое применение идеям. Развернув блокнот, я попробовал набросать алгоритм на основе свойства своей кодировки, а именно — однозначной типизации символа по первым битам. Сжимать таким алгоритмом удобно именно текст, то есть статьи, книги или копипасты из интернетов — то, что состоит из слов, и где регистр букв имеет грамматическое значение. Впоследствии к простому алгоритму добавились средние, основанные на правилах русского языка, и всё это собралось в одну сложную программу, эффективно сжимающую учебник литературы. Назовём его «Литературный архиватор»...",
      "url": "https://m.habrahabr.ru/post/353144/",
      "attachment": "46.jpg",
      "tag": "2"
    },
    {
      "title": "Анализ данных с использованием Python",
      "description": "Язык программирования Python в последнее время все чаще используется для анализа данных, как в науке, так и коммерческой сфере. Этому способствует простота языка, а также большое разнообразие открытых библиотек. В этой статье разберем простой пример исследования и классификации данных с использованием некоторых библиотек на Python. Для исследования, нам понадобится выбрать интересующий нас набор данных (DataSet). Разнообразные наборы Dataset'ы можно скачать с сайта. DataSet обычно представляет собой файл с таблицей в формате JSON или CSV. Для демонстрации возможностей исследуем простой набор данных с информацией о наблюдениях НЛО. Наша цель будет не получить исчерпывающие ответы на главный вопрос жизни, вселенной и всего такого, а показать простоту обработки достаточно большого объема данных средствами Python. Собственно, на месте НЛО могла быть любая таблица...",
      "url": "https://m.habrahabr.ru/post/353050/",
      "attachment": "47.jpg",
      "tag": "16"
    },
    {
      "title": "Как я переучился из тестировщика в .NET-разработчика",
      "description": "Я закончил университет по специальности “Проектирование электронно-вычислительной аппаратуры” в 2005 году. На последних курсах понял, что работать по профессии не буду – учеба за пять лет так и не смогла вдохновить. Тогда я и решил развиваться в сторону IT. Обычно студенты присматриваются к работе, учась на последних курсах – я поступил так же. На пятом курсе пришел в VDI – самую крупную IT-компанию в Рязани, которая год спустя объединилась с EPAM. У них были бесплатные курсы разработчиков, но в тот момент набор туда был закрыт. Зато формировалась группа по тестированию. В 2005 году почти никто не слышал о тестировщиках – в Рязани уж точно. И всё равно я решил записаться в группу. Решил, что начну с тестирования, а потом придумаю, как перейти в разработку...",
      "url": "https://m.habrahabr.ru/company/epam_systems/blog/353192/",
      "attachment": "48.jpg",
      "tag": "18"
    },
    {
      "title": "Выбираем Yii2 или laravel",
      "description": "Я уже писал подобную статью, но она была очень не полной и не снабженной примерами, поэтому я решил взять вторую попытку и попытаться раскрыть данный вопрос наиболее полно! В данной статье, не будут рассматриваться все тонкости разработки на фреймворках, поскольку это не возможно уложить в рамках одной статьи. Однако, можно достаточно подробно разъяснить те нюансы, которые помогут в выборе для изучения или реализации конкретного проекта. Сравнивать будет Yii2 и Laravel. Я понимаю, что это достаточно холиварная тема, результат которой обычно гласит, что каждый хорош по своему. Я, как человек работавший с обеими, попробую разъяснить свой подход к выбору фреймворка, и постараюсь наиболее объективно показать их минусы и плюсы...",
      "url": "https://m.habrahabr.ru/post/353434/",
      "attachment": "49.png",
      "tag": "14"
    },
    {
      "title": "Визуализация связей процессов в Linux",
      "description": "Приходилось ли вам отслеживать зависимости системных процессов, «кто чей папка», найти императора и убить его, чтобы рабы не респаунились? Можно ps'ать и grep'ать, можно lsof погонять, ведь это так увлекательно ;) Но любые связи, как мне кажется, всегда проще анализировать в визуальной форме, консольные утилиты рисуют хорошие таблички, но из них не всегда можно быстро понять, что с чем связано и в какой последовательности, а для диагностики это очень важно. lsof (сокр. LiSt Open Files) при определенной сноровке позволяет строить графы взаимосвязей между запущенными системами, кто какие файлы использует, кто с кем по каким протоколом общается. На хабре уже была статья про то, какой полезный инструмент lsof, но в ней не было ничего сказано про ключ -F, который позволяет выводить информацию не в виде таблицы, а в виде последовательности отдельных строк, которые можно перенаправить на вход другой программы для дальнейшей обработки...",
      "url": "https://m.habrahabr.ru/post/353322/",
      "attachment": "50.jpg",
      "tag": "26"
    },
    {
      "title": "IntelliJ IDEA 2018.1 — улучшенный анализ кода, поддержка частичных коммитов Git, Android Studio 3.0 и многое другое",
      "description": "Недавно мы запустили IntelliJ IDEA 2018.1 – первое большое обновление в этом году. В нем вас ждет множество важных улучшений: поддержка частичных коммитов Git, отображение внешних аннотаций в коде, функциональность, добавленная из Android Studio 3.0, и многое другое...",
      "url": "https://m.habrahabr.ru/company/JetBrains/blog/353494/",
      "attachment": "51.png",
      "tag": "2"
    },
    {
      "title": "Обзор новшеств ECMAScript 2016, 2017, и 2018 с примерами",
      "description": "Сложно уследить за новшествами различных версий ECMAScript, а ещё сложнее — найти полезные примеры их применения, не перекапывая горы информации. Поэтому сегодня мы публикуем перевод материала, автор которого проанализировал 18 новых возможностей ECMAScript, в число которых входят те, что имеются в уже вышедших стандартах ES2016 и ES2017, а также — те, которые должны появиться в стандарте ES2018. Автор этой статьи обещает, что каждый, кто её прочтёт, узнает много интересного и полезного о новых возможностях JavaScript...",
      "url": "https://m.habrahabr.ru/company/ruvds/blog/353174/",
      "attachment": "52.jpg",
      "tag": "22"
    },
    {
      "title": "Что будет если объединить ArrayList и LinkedList?",
      "description": "После изучения коллекций, а именно такие реализации List, как ArrayList и LinkedList, возникла идея, а почему бы не объединить эти структуры данных в одну и посмотреть, что из этого получится. Зачем это нужно? Проблема ArrayList — у него есть начальный размер по умолчанию DEFAULT_CAPACITY или заданный размер initialCapacity, при превышении этого размера, создается новый массив большего размера, при этом туда копируются данные из старого массива, что по времени очень затратно и именно это дает в наихудшем случае алгоритмическую сложность O(n) Проблема LinkedList — здесь наоборот, добавить новый элемент, это всего лишь добавить новую связь (создать еще одну Node и добавить ссылку на неё), но операция получения элемента по индексу очень затратна, т.к. нужно будет пройтись по всему списку от начала, что очень затратно и дает O(n)...",
      "url": "https://m.habrahabr.ru/post/352930/",
      "attachment": "53.png",
      "tag": "2"
    },
    {
      "title": "Знакомство с новым элементом dialog",
      "description": "HTML 5.2 представил новый элемент dialog для нативных модальных окон. На первый взгляд, он кажется довольно простым (так и есть), но поигравшись с ним я обнаружил, что он имеет несколько замечательных возможностей, которые легко упустить...",
      "url": "https://m.habrahabr.ru/post/353014/",
      "attachment": "54.jpg",
      "tag": "2"
    },
    {
      "title": "Tooltip-ы в Power BI — новая функция для Desktop",
      "description": "В середине марта вышло очередное обновление Power BI Desktop. Microsoft добавил пару интересных функций, в том числе возможность пользователям самим создавать всплывающие подсказки — Tooltips...",
      "url": "https://m.habrahabr.ru/post/352932/",
      "attachment": "55.jpg",
      "tag": "2"
    },
    {
      "title": "Что нового в DataGrip 2018.1",
      "description": "В этом релизном цикле некоторые улучшения появились ещё в минорных обновлениях. Но, так как о них на Хабре мы не пишем, я расскажу в этом посте обо всём новом с момента предыдущего релиза...",
      "url": "https://m.habrahabr.ru/company/JetBrains/blog/352902/",
      "attachment": "56.png",
      "tag": "2"
    },
    {
      "title": "Взаимные превращения JSON, YAML, XML",
      "description": "Попробуем использовать «ретро технологии» для работы с данными в формате JSON и YAML. И порассуждаем о причинах применять их в наши дни. Есть задача — логику трансформации данных вынести в конфигурацию приложения, желательно в декларативном стиле и унифицировано для разных форматов. Данные могут быть в различных текстовых форматах сериализации json, yaml, xml, java properties, ini file. Но при этом Data Lake слишком тяжелая артиллерия для этого. Помещать данные в документоориентированную или объектно-реляционную базу и пытаться выполнять запросы по загруженным туда данным тоже over engineering для первого этапа ETL трансформации...",
      "url": "https://m.habrahabr.ru/post/352810/",
      "attachment": "57.png",
      "tag": "2"
    },
    {
      "title": "Разработка AI для пошаговой игры на Node.js (часть 1)",
      "description": "Признаться честно, я вообще хотел забросить проект, так как свои плоды и опыт он уже принёс. Но меня всегда интересовало машинное обучение, поэтому я занялся поиском информации по нейронным сетям. Спустя некоторое время я пришёл к выводу: мне нужна среда для обучения сети. Для этого идеально подошла моя игра с непаханым полем для создания обучающихся ботов...",
      "url": "https://m.habrahabr.ru/post/345576/",
      "attachment": "58.png",
      "tag": "24"
    },
    {
      "title": "Адский проект",
      "description": "Несколько лет назад меня пригласили консультантом по одному проекту ПО для крупной французской технологической компании. Увиденное выходит за рамки всего, что я мог представить в разработке. Простое отсутствие профессиональной компетентности оказалось не самым худшим. Гораздо хуже было крайнее презрение к человеческому достоинству, что показалось мне сравнимо с тюрьмой в том виде, как я её представляю. Вот список, проверьте сами...",
      "url": "https://m.habrahabr.ru/post/352688/",
      "attachment": "59.jpg",
      "tag": "2"
    },
    {
      "title": "REST-сервисы на ASP.NET Core под Linux в продакшене",
      "description": "В основе этой статьи доклад Дениса Иванова (@DenisIvanov) на РИТ++ 2017, в котором он поделился опытом разработки и запуска в продакшен REST-сервиса на ASP.NET Core на Kubernetes. На текущий момент это сделать уже можно без особенных проблем и бояться использовать .NET Core, судя по опыту 2ГИС, не стоит. Конфигурация: ASP.NetCore на Linux позволила не только использовать существующую on-premise платформу, но и принесла еще несколько дополнительных плюсов, в частности, в виде полноценных Docker и Kubernetes, которые сильно упрощают жизнь...",
      "url": "https://m.habrahabr.ru/company/oleg-bunin/blog/352168/",
      "attachment": "60.jpg",
      "tag": "18"
    },
    {
      "title": "Новинки C# 7.2. Span<T> и Memory<T>",
      "description": "Вышел новый релиз языка C# версии 7.2, в котором были реализованы новые возможности. По словам кампании Microsoft, одной из основных целей данного выпуска было увеличение эффективности работы с типами данных хранимых по значению (в стеке), путем ухода от избыточного выделения памяти и выполнения ненужных операций копирования. Давайте рассмотрим основные новинки языка...",
      "url": "https://shwanoff.ru/new-c-7-2/",
      "attachment": "61.jpg",
      "tag": "18"
    },
    {
      "title": "Какие образы будущего нам рисуют крупнейшие ИТ-компании",
      "description": "Подрастает орда миллениалов, кругом одни фрилансеры, работающие за биткоины, вот-вот вылупится зародыш искуственного интеллекта, толпы бессмертных людей воюют против… «Черное зеркало», «Элизиум», «Видоизмененный углерод», «Бегущий по лезвию», «Электрические сны Филлипа Дика», «Рик и Морти». «Мы», «Скотный двор», «О дивный новый мир», «1984». Какие «картинки» у нас в голове про будущее? Под катом — обзор роликов с видением будущего от Intel, Microsoft, Google, Citrix...",
      "url": "https://m.habrahabr.ru/company/goto/blog/345978/",
      "attachment": "62.jpg",
      "tag": "2"
    },
    {
      "title": "Загоним мамонта в яму: как провести презентацию, чтобы вас услышали и запомнили",
      "description": "Многие из нас бывали на айтишных конференциях. А если не бывали, то наверняка смотрели трансляции, записи или читали расшифровки докладов на Хабре. А вы знаете, какие доклады становятся хитами даже на самых-самых хардкорных мероприятиях? Внутренности сложных технологий? Нет. DevOps? Отнюдь. Чаще всего приз зрительских симпатий берут так называемые доклады-кейноуты — презентации людей, вовсе не обязательно связанных с IT. Дело не в красивой презентации и даже не в харизме докладчика, а в том, что эти ребята знают секрет SUCCES. Нет, мы не опечатались...",
      "url": "https://m.habrahabr.ru/company/lanit/blog/344490/",
      "attachment": "63.jpg",
      "tag": "2"
    }
  ]
}